app/controllers/account_activations_controller.rb

SELECT  1 AS one FROM `users` WHERE `users`.`email` = BINARY 'dinesh.padisetti@gmail.com' AND (`users`.`id` != 10) LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'dinesh.padisetti@gmail.com' LIMIT 1
UPDATE `users` SET `activated` = 1, `activated_at` = '2018-02-18 11:37:21', `updated_at` = '2018-02-18 11:37:21' WHERE `users`.`id` = 10
---
  def edit
    user_activation_token = user_params[:id]
    user_email = user_params[:email]
    if User.exists?(email: user_email)
      user = User.find_by_email(user_email)
      user_activation_digest =  BCrypt::Password.new(user.activation_digest)
      if user_activation_digest == user_activation_token
        if !user.activated && user.activated_at.nil?
          user.update_attributes(activated: true, activated_at: Time.now)