app/controllers/savings_deposits_controller.rb

  def index
    if User.exists?(params[:user_id])
      @user = User.find(params[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

  def create
    if User.exists?(params[:user_id])
      @user = User.find(params[:user_id])
      if @current_user.id == @user.id || (@current_user.role == "admin" && @user.role != "admin")
        @savings_deposit = SavingsDeposit.new(savings_deposits_params)
        if @savings_deposit.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
INSERT INTO `savings_deposits` (`bank_name`, `account_number`, `initial_amount`, `start_date`, `end_date`, `interest_percentage`, `taxes_percentage`, `user_id`, `created_at`, `updated_at`) VALUES ('State Bank of India', 62445376806, 4000.0, '2018-02-22 00:00:00', '2028-02-22 00:00:00', -12.0, 10.0, 4, '2018-02-23 07:15:06', '2018-02-23 07:15:06')

  def show
    if User.exists?(params[:user_id])
      @user = User.find(params[:user_id])
      if @current_user.id == @user.id || (@current_user.role == "admin" && @user.role != "admin")
        if SavingsDeposit.exists?(id: params[:id], user_id: @user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT  1 AS one FROM `savings_deposits` WHERE `savings_deposits`.`id` = 1 AND `savings_deposits`.`user_id` = 4 LIMIT 1
SELECT  1 AS one FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT  `savings_deposits`.* FROM `savings_deposits` WHERE `savings_deposits`.`id` = 1 LIMIT 1

  def update
    if User.exists?(params[:user_id])
      @user = User.find(params[:user_id])
      if SavingsDeposit.exists?(id: params[:id], user_id: params[:user_id])
        @savings_deposit = SavingsDeposit.find(params[:id])
        if @current_user.role != "admin" && @current_user.id == @user.id && @savings_deposit.update(savings_deposits_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT  1 AS one FROM `savings_deposits` WHERE `savings_deposits`.`id` = 1 AND `savings_deposits`.`user_id` = 3 LIMIT 1
SELECT  `savings_deposits`.* FROM `savings_deposits` WHERE `savings_deposits`.`id` = 1 LIMIT 1
UPDATE `savings_deposits` SET `user_id` = 4, `initial_amount` = 2500.0, `updated_at` = '2018-02-22 08:21:01' WHERE `savings_deposits`.`id` = 1

  def destroy
    if User.exists?(params[:user_id])
      @user = User.find(params[:user_id])
      if @current_user.id == @user.id || (@current_user.role == "admin" && @user.role != "admin")
        if SavingsDeposit.exists?(id: params[:id], user_id: @user.id)
          @savings_deposit = SavingsDeposit.find(params[:id])
          @savings_deposit.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT  1 AS one FROM `savings_deposits` WHERE `savings_deposits`.`id` = 1 AND `savings_deposits`.`user_id` = 3 LIMIT 1
SELECT  1 AS one FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT  `savings_deposits`.* FROM `savings_deposits` WHERE `savings_deposits`.`id` = 1 LIMIT 1
DELETE FROM `savings_deposits` WHERE `savings_deposits`.`id` = 1