app/controllers/users_controller.rb

  def show
    if User.exists?(params[:id])
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Vaishnavi', 'adella.vaishnavi@gmail.com', '$2a$10$UmGqyd7HmzgR6WzNEbBP2u3DkUYBwUCbC7X502jbU9XFrlzajLmuG', '2018-02-12 11:17:14', '2018-02-12 11:17:14')

  def update
    if User.exists?(params[:id])
      @user = User.find(params[:id])
      if !user_update_params[:role].nil? && @current_user.role != "admin"
        render json: {error_msg: "Only admin user can promote roles!"}, status: :unauthorized
      elsif user_update_params[:role] && @current_user.role == "admin" && user_update_params[:role] == "admin"
        render json: {error_msg: "No one can make admin users!"}, status: :unauthorized
      elsif (@user.id == @current_user.id || User.roles[@current_user.role] > User.roles[@user.role]) &&  @user.update(user_update_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE `users` SET `password_digest` = '$2a$10$I3PJra7LyTApbH1BrtHXr.A.uKQvDd3OSZnJYDINTDbRTI5spFeh.', `updated_at` = '2018-02-14 00:22:07' WHERE `users`.`id` = 6

  def destroy
    if User.exists?(params[:id])
      @user = User.find(params[:id])
      if (@user.id == @current_user.id || User.roles[@current_user.role] > User.roles[@user.role]) && @user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 6

  def generate_revenue_report
    if User.exists?(params[:id])
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1